CSI API ETABS v1
cTower.GetActiveTower Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetActiveTower(
	ref string TowerName
)
Function GetActiveTower (
	ByRef TowerName As String
) As Integer
Dim instance As cTower
Dim TowerName As String
Dim returnValue As Integer
returnValue = instance.GetActiveTower(TowerName)
int GetActiveTower(
	String^% TowerName
)
abstract GetActiveTower :
        TowerName : string byref -> int
Parameters
TowerName
Type: System.String
Return Value
Type: Int32
See Also
Reference
cTower Interface
ETABSv1 Namespace